================================================================================
Empty manuscript with newline
================================================================================

:rsm:

::

--------------------------------------------------------------------------------

(source_file)


================================================================================
Empty manuscript with space
================================================================================

:rsm: ::

--------------------------------------------------------------------------------

(source_file)


================================================================================
Empty manuscript with nothing
================================================================================

:rsm:::

--------------------------------------------------------------------------------

(source_file)


================================================================================
Manuscript with title
================================================================================

:rsm:
# Title

Lorem ipsum.

::

--------------------------------------------------------------------------------

(source_file
  title: (text)
  (paragraph
    (text)))


================================================================================
Manuscript with one paragraph with newline
================================================================================

:rsm:

Lorem ipsum.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))


================================================================================
Manuscript with one paragraph with space
================================================================================

:rsm:

Lorem ipsum. ::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))


================================================================================
Manuscript with one paragraph with nothing
================================================================================

:rsm:

Lorem ipsum.::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))


================================================================================
Manuscript with title and paragraph
================================================================================

:rsm:
  :title: My Title

Lorem ipsum.

::

--------------------------------------------------------------------------------

(source_file
  meta: (blockmeta
    (pair
      (metakey_text (title))
      (metaval_text)))
  (paragraph
    (text)))


================================================================================
Manuscript with title
================================================================================

:rsm:
  :title: My Title

::

--------------------------------------------------------------------------------

(source_file
  meta: (blockmeta
    (pair
      (metakey_text (title))
      (metaval_text))))


================================================================================
Manuscript with title and meta
================================================================================

:rsm:
  :label: mylbl
  :title: My Title
  :date: 2022-03-29
::

--------------------------------------------------------------------------------

(source_file

  meta: (blockmeta
    (pair
      (metakey_text (label))
      (metaval_text))
    (pair
      (metakey_text (title))
      (metaval_text))
    (pair
      (metakey_any (date))
      (metaval_any))))


================================================================================
Section
================================================================================

:rsm:

:section:

  Foo.

::

--------------------------------------------------------------------------------

(source_file
  (section
    (paragraph
      (text))))


================================================================================
Section with title
================================================================================

:rsm:

:section:
  :title: Section title

  Foo.

::

--------------------------------------------------------------------------------

(source_file
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text)))
    (paragraph
      (text))))


================================================================================
Section with meta
================================================================================

:rsm:

:section:
  :title: Section title
  :types: {t1, t2}

  Foo.

::

--------------------------------------------------------------------------------

(source_file
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text))
      (pair
        (metakey_list (types))
        (metaval_list
          (metaval_list_item)
          (metaval_list_item))))
    (paragraph
      (text))))


================================================================================
Author and abstract
================================================================================

:rsm:
:label: mylbl
:title: The Perron non-backtracking eigenvalue after node addition
:date: 2022-03-29

:author:
  :name: Leo Torres
  :affiliation: Max Planck Institute for Mathematics in the Sciences
  :email: leo@leotrs.com
::

:abstract:
  :keywords: {spectral graph theory, non-backtracking, interlacing}
  :msc: {05C50, 05C82, 15A18, 15B99}

  Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem
  ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem
  ipsum. Lorem ipsum.

  Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem
  ipsum. Lorem ipsum.

::

::

--------------------------------------------------------------------------------

(source_file
  meta: (blockmeta
    (pair
      (metakey_text (label))
      (metaval_text))
    (pair
      (metakey_text (title))
      (metaval_text))
    (pair
      (metakey_any (date))
      (metaval_any)))
  (block
    tag: (author)
    meta: (blockmeta
      (pair
        (metakey_text (name))
        (metaval_text))
      (pair
        (metakey_text (affiliation))
        (metaval_text))
      (pair
        (metakey_text (email))
        (metaval_text))))
  (block
    tag: (abstract)
    meta: (blockmeta
      (pair
        (metakey_list (keywords))
        (metaval_list
          (metaval_list_item)
          (metaval_list_item)
          (metaval_list_item)))
      (pair
        (metakey_list (msc))
        (metaval_list
          (metaval_list_item)
          (metaval_list_item)
          (metaval_list_item)
          (metaval_list_item))))
    (paragraph
      (text)
      (text)
      (text))
    (paragraph
      (text)
      (text))))


================================================================================
Inline meta no space
================================================================================

:rsm:

Foo :claim: {:label:lbl} bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
          (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space before
================================================================================

:rsm:

Foo :claim: { :label:lbl} bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space after
================================================================================

:rsm:

Foo :claim: {:label:lbl } bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space between
================================================================================

:rsm:

Foo :claim: {:label: lbl} bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space all
================================================================================

:rsm:

Foo :claim: { :label: lbl } bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta no space after tag
================================================================================

:rsm:

Foo :claim:{:label: lbl} bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta no space after meta
================================================================================

:rsm:

Foo :claim: {:label: lbl}bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline math no shortcut
================================================================================

:rsm:

:math:X::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (math)
      (asis_text))
    (text)))


================================================================================
Inline code no shortcut
================================================================================

:rsm:

:code:X::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (code)
      (asis_text))
    (text)))


================================================================================
Block code no shortcut
================================================================================

:rsm:

:codeblock:
  comp = [abs(x) for x in range(10)]
::

::

--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (codeblock)
    (asis_text)))


================================================================================
Block code no shortcut and meta
================================================================================

:rsm:

:codeblock:
  :label: some-code
  :types: python

  comp = [abs(x) for x in range(10)]

::

::

--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (codeblock)
    meta: (blockmeta
      (pair
        (metakey_text (label))
   (metaval_text))
      (pair
        (metakey_list (types))
        (metaval_list
          (metaval_list_item))))
    (asis_text)))


================================================================================
Math inside claim
================================================================================

:rsm:

:claim: :math:2+2=4:: ::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Math inside claim no space
================================================================================

:rsm:

:claim::math:2+2=4::::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Claim with meta and math
================================================================================

:rsm:

:claim: {:label: lbl} all $X$ are $Y$::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
          (metakey_text (label))
          (metaval_text)))
      (text)
      (specialinline
        tag: (math)
        (asis_text))
      (text)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Enumerate
================================================================================

:rsm:

:enumerate:

  :item: Foo.

  :item: Bar.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        (text)))
    (paragraph
      (item
        (text)))))


================================================================================
Enumerate no space before Halmos
================================================================================

:rsm:

:enumerate:

  :item: Foo.::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        (text)))))


================================================================================
Enumerate items with label
================================================================================

:rsm:

:enumerate:

  :item: {:label: one} Foo.

  :item: {:label: two} Bar.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))))


================================================================================
Itemize
================================================================================

:rsm:

:itemize:

  :item: Foo.

  :item: Bar.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (itemize)
    (paragraph
      (item
        (text)))
    (paragraph
      (item
        (text)))))


================================================================================
Itemize no space before Halmos
================================================================================

:rsm:

:itemize:

  :item: Foo.::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (itemize)
    (paragraph
      (item
        (text)))))


================================================================================
Itemize items with label
================================================================================

:rsm:

:itemize:

  :item: {:label: one} Foo.

  :item: {:label: two} Bar.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (itemize)
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))))

================================================================================
Proof with no steps
================================================================================

:rsm:

:proof:

  By some axiom.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (paragraph
      (text))))


================================================================================
Proof with one step
================================================================================

:rsm:

:proof:

  :step: Axiom. ::

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text)))))



================================================================================
Proof with three steps
================================================================================

:rsm:

:theorem:

  Socrates is mortal.

::

:proof:

  :step: All men are mortal. ::

  :step: Socrates is a man. ::

  :step: QED ::

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (theorem)
    (paragraph
      (text)))
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text)))
    (block
      tag: (step)
      (paragraph
        (text)))
    (block
      tag: (step)
      (paragraph
        (text)))))


================================================================================
Proof with sub-step and sub-proof
================================================================================

:rsm:

:proof:

  :step: Top level step.

    :step: Sub-step.

      :p: Sub-proof.::

    ::
  ::

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text))
      (block
        tag: (step)
        (paragraph
          (text))
        (block
          tag: (subproof)
          (paragraph
            (text)))))))


================================================================================
Span strong
================================================================================

:rsm:

:span: {:strong:}shortcut::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (strong))))
      (text))
    (text)))


================================================================================
Span emphas
================================================================================

:rsm:

:span: {:emphas:}shortcut::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (emphas))))
      (text))
    (text)))


================================================================================
Span strong and emphas
================================================================================

:rsm:

:span: {:strong:, :emphas:}shortcut::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (strong)))
        (pair
          (metakey_bool (emphas))))
      (text))
    (text)))


================================================================================
Strong half word
================================================================================

:rsm:

Bo:span:{:strong:}ld::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (strong))))
      (text))
    (text)))


================================================================================
Reference
================================================================================

:rsm:

## Foo
  :label: lbl

Bar.

:ref:lbl::.

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text))
      (text))))


================================================================================
Reference with space
================================================================================

:rsm:

## Foo
  :label: lbl

Bar.

:ref: lbl ::.

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text))
      (text))))


================================================================================
Reference with reftext
================================================================================

:rsm:

## Foo
  :label: lbl

Bar.

:ref:lbl,the section::.

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text)
        reftext: (text))
      (text))))


================================================================================
Reference with reftext with space
================================================================================

:rsm:

## Foo
  :label: lbl

Bar.

:ref: lbl , the section ::.

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text)
        reftext: (text))
      (text))))


================================================================================
Escaped colon
================================================================================

:rsm:

Foo\: bar.

::

--------------------------------------------------------------------------------

(source_file

  (paragraph
    (text)))


================================================================================
Escaped colon inside span
================================================================================

:rsm:

:span: Foo\: bar::.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      (text))
    (text)))


================================================================================
ERROR: unclosed strong region
================================================================================

:rsm:

Bo*ld.

::

--------------------------------------------------------------------------------

(source_file
  (ERROR
    (text)
    (spanstrong)
    (text)))


================================================================================
Escaped star
================================================================================

:rsm:

Bo\*ld.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))


================================================================================
Figure
================================================================================

:rsm:

:figure:

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (figure)))


================================================================================
Figure with meta and caption
================================================================================

:rsm:

:figure:
  :path: assets/example.png

  :caption: This is the figure caption.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (figure)
    meta: (blockmeta
      (pair
        (metakey_any (path))
        (metaval_any)))
    (paragraph
      (caption
        (text)))))


================================================================================
ERROR: item in the wrong place
================================================================================

:rsm:

## Some section

Lorem ipsum :item: Foo bar.

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (paragraph
      (text)
      (ERROR)
      (text))))


================================================================================
List meta pair inside inline meta region
================================================================================

:rsm:

Foo :span: {:types: {t1, t2}} bar :: baz.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_list (types))
          (metaval_list
            (metaval_list_item)
            (metaval_list_item))))
      (text))
    (text)))


================================================================================
Cite
================================================================================

:rsm:

:cite:foo::

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (cite)
      targetlabels: (text))))


================================================================================
Cite with multiple targets
================================================================================

:rsm:

:cite:foo,bar::

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (cite)
      targetlabels: (text))))


================================================================================
Claimshort within item with meta
================================================================================

:rsm:

:enumerate:

  :item: {:label: one} :⊢: $2+2=4$::.

  :item: {:label: two} :⊢: $3+3=6$::.

::

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (construct
          tag: (claim)
          (specialinline
            tag: (math)
            (asis_text)))
        (text)))
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (construct
          tag: (claim)
          (specialinline
            tag: (math)
            (asis_text)))
        (text)))))


================================================================================
Appendix
================================================================================

:rsm:

## Foo

:appendix:

## Bar

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text))
  (appendix)
  (section
    title: (text)))


================================================================================
Table of Contents
================================================================================

:rsm:

:toc: ::

::

--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (toc)))


================================================================================
Space after closing mathblock should be allowed
================================================================================

:rsm:

There is a single space after the closing double dollar sign, which makes the following
paragraph freak out on the first letter for some reason.

$$
2+2
$$

x

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text))
  (mathblock
    (asis_text))
  (paragraph
    (text)))


================================================================================
Mathblock with isclaim meta
================================================================================

:rsm:

$$
:isclaim:
  2+2 = 4
$$

:mathblock:
:isclaim:
  2+2 = 4
::

::

--------------------------------------------------------------------------------

(source_file
  (mathblock
    meta: (blockmeta
      (pair
        (metakey_bool (isclaim))))
    (asis_text))
  (mathblock
    meta: (blockmeta
      (pair
        (metakey_bool (isclaim))))
    (asis_text)))


================================================================================
Whitespace after block halmos
================================================================================

:rsm:

:theorem:

  Note the trailing whitespace after the Halmos!

::

foo.

::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (theorem)
    (paragraph
      (text)))
  (paragraph
    (text)))


================================================================================
QED inside step
================================================================================

:rsm:

:proof:

  :step:
    :qed:
  ::

::

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (specialconstruct
          tag: (qed))))))


================================================================================
Section with icon
================================================================================

:rsm:

:section:
  :title: Section title
  :icon: bookmark

  Foo.

::

--------------------------------------------------------------------------------

(source_file
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text))
      (pair
        (metakey_text (icon))
        (metaval_text)))
    (paragraph
      (text))))


================================================================================
Paragraph does not end at mathblock
================================================================================

:rsm:

Foo.
$$
2+2=4,
$$
bar.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (mathblock
      (asis_text))
    (text)))


================================================================================
Section ends when another begins
================================================================================

:rsm:

## Section 1

## Section 2

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text))
  (section
    title: (text)))


================================================================================
Subsection ends when a section begins
================================================================================

:rsm:

## Section 1

### Subsection

## Section 2

::

--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (subsection
      title: (text)))
  (section
    title: (text)))


================================================================================
Manuscript with top level paragraph and section
================================================================================

:rsm:

Lorem ipsum.

:section:
  :title: section title

Lorem ipsum.

::

--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text))
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text)))
    (paragraph
      (text))))
